n = input("Please give me a number for n: ");

a = [4 1 0 0 0 1;
     1 4 1 0 0 0;
     0 1 4 1 0 0;
     0 0 1 4 1 0;
     0 0 0 1 4 1;
     1 0 0 0 1 4]   %Δημιουργια και εμφανιση του πινακα Α 
disp("")
b = [3; 0; -3; 3; 0; -3;] %Δημιουργια και εμφανιση του διανυσματος b

sum = 0;
temp = 0;
%Ελεγχος για την κυρια διαγωνιο και κραταω εναν μετρητη για να δω αν συνθηκη ισχυει για ολα τα στοιχεια της διαγωνιου
for i = 1:n
	for j =1:n
		if i!=j
			sum = sum + abs(a(i,j));   
			if sum<abs(a(i,i))	
				temp = temp+1;
			end
		end
	end
end

if temp == n %Ελεγχος αν ο μετρητης της παραπανω συνθηκης ειναι ιδιος με την διασταση του πινακα ετσι ωστε να πραγματοποιηθει η LU παραγοντοποιηση και να βρεθει η λυση του συστηματος
	L = zeros(n,n); %Αρχικοποιηση του L πινακα
	U = zeros(n,n); %Αρχικοποιηση του U πινακα
	x = zeros(n,1); %Αρχικοποιηση του x διανυσματος
  	y = zeros(n,1); %Αρχικοποιηση του y διανυσματος
        %Καταχωρηση τιμων στους πινακες L,U
	for i = 1:n
		for j = 1:i-1
			sum1 = 0;	
			for k = 1:j-1
				sum1 = sum1 + L(i,k)*U(k,j);
			end
			L(i,j) = (a(i,j) - sum1)/U(j,j);
		end
		L(i,i) = 1; 
		for j = i:n
     			sum2 = 0;
			for k = 1:i-1
				sum2 = sum2 + L(i,k)*U(k,j);
			end
			U(i,j) = a(i,j) - sum2;
		end
	end
  disp("L = ")
  disp(L) %Εμφανιση του L πινακα
  disp("")
  disp("U = ")
  disp(U) %Εμφανιση του U πινακα
  %Λυση του Ly=b για τον υπολογισμο του διανυσματος y με την μεθοδο απαλοιφης Guass
	for i = 1:n
		sum4 =0;
		for k = 1:i
			sum4 = sum4 + L(i,k)*y(k);
		end
		y(i) = b(i) - sum4;
	end
	disp("")
	disp("y = ") 
	disp(y) %Εμφανιση του διανυσματος y
	%Λυση του Ux = y για τον υπολογισμο του διανυσματος x οπου ειναι και η λυση με την μεθοδο απαλοιφης Guass
	for i = n:-1:1
		sum3 = 0;
		for j = i:n
			sum3 = sum3 + U(i,j)*x(j); 
		end
		x(i) = (1/U(i,i)*(y(i)-sum3));
	end 
  disp("")
  disp("x = ")
  disp(x) %Εμφανιση του διανυσματος x οπου ειναι και η λυση
end


a = [10 2 1 -1 2 0 1 1 1;
     -1 15 -1 1 0 -3 0 5 2;
     -2 -1 16 2 3 4 2 1 -1;
     1 2 3 20 3 0 4 2 1;
     -3 -2 -1 1 22 -1 5 2 2;
     -1 -3 -1 1 -4 38 9 4 -1;
     3 -1 1 -1 -3 1 32 7 1;
     -2 4 1 -2 -4 -2 12 30 2;
     -1 2 2 -1 -2 -4 6 3 42] %Δημιουργια και εμφανιση του πινακα Α 
disp("")
b = [8; 2; -17; 21; 3; -27; 31; 7; -36;] %Δημιουργια και εμφανιση του διανυσματος b

disp("")
n = input("Please give me a number for n: ");

sum = 0;
temp = 0;
%Ελεγχος για την κυρια διαγωνιο και κραταω εναν μετρητη για να δω αν συνθηκη ισχυει για ολα τα στοιχεια της διαγωνιου
for i = 1:n
	for j =1:n
		if i!=j
			sum = sum + abs(a(i,j));   
			if sum<abs(a(i,i))	
				temp = temp+1;
			end
		end
	end
end

if temp != n %Ελεγχος αν ο μετρητης της παραπανω συνθηκης ειναι ιδιος με την διασταση του πινακα ετσι ωστε να πραγματοποιηθει η LU παραγοντοποιηση και να βρεθει η λυση του συστηματος
	L = zeros(n,n); %Αρχικοποιηση του L πινακα
	U = zeros(n,n); %Αρχικοποιηση του U πινακα
	x = zeros(n,1); %Αρχικοποιηση του x διανυσματος
  	y = zeros(n,1); %Αρχικοποιηση του y διανυσματος
        %Καταχωρηση τιμων στους πινακες L,U
	for i = 1:n
		for j = 1:i-1
			sum1 = 0;	
			for k = 1:j-1
				sum1 = sum1 + L(i,k)*U(k,j);
			end
			L(i,j) = (a(i,j) - sum1)/U(j,j);
		end
		L(i,i) = 1; 
		for j = i:n
     			sum2 = 0;
			for k = 1:i-1
				sum2 = sum2 + L(i,k)*U(k,j);
			end
			U(i,j) = a(i,j) - sum2;
		end
	end
  disp("L = ")
  disp(L) %Εμφανιση του L πινακα
  disp("")
  disp("U = ")
  disp(U) %Εμφανιση του U πινακα
  %Λυση του Ly=b για τον υπολογισμο του διανυσματος y με την μεθοδο απαλοιφης Guass
	for i = 1:n
		sum4 =0;
		for k = 1:i
			sum4 = sum4 + L(i,k)*y(k);
		end
		y(i) = b(i) - sum4;
	end
	disp("")
	disp("y = ") 
	disp(y) %Εμφανιση του διανυσματος y
	%Λυση του Ux = y για τον υπολογισμο του διανυσματος x οπου ειναι και η λυση με την μεθοδο απαλοιφης Guass
	for i = n:-1:1
		sum3 = 0;
		for j = i:n
			sum3 = sum3 + U(i,j)*x(j); 
		end
		x(i) = (1/U(i,i)*(y(i)-sum3));
	end 
  disp("")
  disp("x = ")
  disp(x) %Εμφανιση του διανυσματος x οπου ειναι και η λυση
end

