o=1;
%Συναρτηση υπολογισμου της αρχικης f(x)
function newton = f1(x) 
  newton = x^3-2*x-5;  
end
 
%Συναρτηση υπολογισμου της παραγωγου της αρχικης f(x) 
function fun = fDer1(x) 
  fun = 3*(x^2)-2;    
end
   
%Συναρτηση υπολογισμου της f(x)
function fun1 = f(x)
  	fun1 = x^2+2*x-3;
end

%Συναρτηση υπολογισμου της παραγωγου της f(x) 
function fun2 = fDer(x)
  	fun2 = 2*x+2;
end
 
%Συναρτηση υπολογισμου της g(x)
function fun3 = g(x)
  	fun3 = -x^2-2*x+3;
end

%Συναρτηση υπολογισμου της παραγωγου της g(x) 
function fun4 = gDer(x)
  	fun4 = -2*x-2;
end

%Συναρτηση υπολογισμου της h(x)
function fun5 = h(x)
  	fun5 = x^2-2*x-3;
end

%Συναρτηση υπολογισμου της παραγωγου της h(x) 
function fun6 = hDer(x)
  	fun6 = 2*x - 2;
end

%Συναρτηση υπολογισμου της k(x)
function fun7 = k(x)
  	fun7 = -x^2+2*x+3;
end 

%Συναρτηση υπολογισμου της παραγωγου της k(x) 
function fun8 = kDer(x)
  	fun8 = -2*x +2;
end

format long  

TOL = 10^(-6); %Αρχικοποιηση σφαλματος
x = 5; %Αρχικοποιηση του χ0
NMAX= 10; %Αρχικοποιηση των επαναληψεων
a=[1 NMAX]; %Δημιουργια πινακα για τον αποτελεσματων
for n = 1:NMAX 
  a(n,1) = n-1; %Το n που θα εμφανιζεται στον παραπανω πινακα
  a(n,2) = x; %Το χn που θα εμφανιζεται στον παραπανω πινακα
  a(n,3) = f1(x); %Συναρτηση που θα εμφανιζεται παραπανω στον πινακα
  y = x - f1(x)/fDer1(x); %Υπολογισμος του x*
 if abs(y-x) <= TOL %Ελεγχος αν το x*  ειναι ριζα 
   disp("The root is: ")
   disp(y) %Εμφανιση ριζας
   break  %Τερματισμος σε περιπτωση που το προγραμμα βρει την ριζα πριν τελειωσουν οι NMAX επαναληψεις 
  end
  x=y;
  disp("")
end
  
if n == NMAX %Eλεγχος αν δεν βρεθηκε ριζα στις NMAX
  disp("Solution was not obtained in 10 iterations")
  disp("The root doesn't exist") %Εμφανιση μηνυματος οτι δεν βρεθηκε ριζα
end
disp("            n                 xn                    f(x)     ");
disp(a) %Εμφανιση του πινακα με τα αποτεσματα


TOL = 10^(-6); %Αρχικοποιηση σφαλματος
x = 0; %Αρχικοποιηση του χ0
NMAX= 20; %Αρχικοποιηση των επαναληψεων
a=[1 NMAX]; %Δημιουργια πινακα για τον αποτελεσματων
for n = 1:NMAX 
  a(n,1) = n-1; %Το n που θα εμφανιζεται στον παραπανω πινακα
  a(n,2) = x; %Το χn που θα εμφανιζεται στον παραπανω πινακα
  a(n,3) = f1(x); %Συναρτηση που θα εμφανιζεται παραπανω στον πινακα
  y = x - f1(x)/fDer1(x); %Υπολογισμος του x*
 if abs(y-x) <= TOL %Ελεγχος αν το x*  ειναι ριζα 
   disp("The root is: ")
   disp(y) %Εμφανιση ριζας
   break  %Τερματισμος σε περιπτωση που το προγραμμα βρει την ριζα πριν τελειωσουν οι NMAX επαναληψεις 
  end
  x=y;
  disp("")
end
  
if n == NMAX %Eλεγχος αν δεν βρεθηκε ριζα στις NMAX
  disp("Solution was not obtained in 10 iterations")
  disp("The root doesn't exist") %Εμφανιση μηνυματος οτι δεν βρεθηκε ριζα
end
disp("            n                 xn                    f(x)     ");
disp(a) %Εμφανιση του πινακα με τα αποτεσματα



TOL = 10^(-5); %Αρχικοποιηση σφαλματος
x = 5; %Αρχικοποιηση του χ0
NMAX= 10; %Αρχικοποιηση των επαναληψεων
a=[1 NMAX]; %Δημιουργια πινακα για τον αποτελεσματων
for n = 1:NMAX 
  a(n,1) = n-1; %Το n που θα εμφανιζεται στον παραπανω πινακα
  a(n,2) = x; %Το χn που θα εμφανιζεται στον παραπανω πινακα
  a(n,3) = f(x); %Συναρτηση που θα εμφανιζεται παραπανω στον πινακα
  y = x - f(x)/fDer(x); %Υπολογισμος του x*
 if abs(y-x) <= TOL %Ελεγχος αν το x*  ειναι ριζα 
   disp("The root is: ")
   disp(y) %Εμφανιση ριζας
   break  %Τερματισμος σε περιπτωση που το προγραμμα βρει την ριζα πριν τελειωσουν οι NMAX επαναληψεις 
  end
  x=y;
  disp("")
end
  
if n == NMAX %Eλεγχος αν δεν βρεθηκε ριζα στις NMAX
  disp("Solution was not obtained in 10 iterations")
  disp("The root doesn't exist") %Εμφανιση μηνυματος οτι δεν βρεθηκε ριζα
end
disp("            n                 xn                    f(x)     ");
disp(a) %Εμφανιση του πινακα με τα αποτεσματα


x = 5; %Αρχικοποιηση του χ0
NMAX= 10; %Αρχικοποιηση των επαναληψεων
a=[1 NMAX]; %Δημιουργια πινακα για τον αποτελεσματων
for n = 1:NMAX 
  a(n,1) = n-1; %Το n που θα εμφανιζεται στον παραπανω πινακα
  a(n,2) = x; %Το χn που θα εμφανιζεται στον παραπανω πινακα
  a(n,3) = g(x); %Συναρτηση που θα εμφανιζεται παραπανω στον πινακα
  y = x - g(x)/gDer(x); %Υπολογισμος του x*
 if abs(y-x) <= TOL %Ελεγχος αν το x*  ειναι ριζα 
   disp("The root is: ")
   disp(y) %Εμφανιση ριζας
   break  %Τερματισμος σε περιπτωση που το προγραμμα βρει την ριζα πριν τελειωσουν οι NMAX επαναληψεις 
  end
  x=y;
  disp("")
end
  
if n == NMAX %Eλεγχος αν δεν βρεθηκε ριζα στις NMAX
  disp("Solution was not obtained in 10 iterations")
  disp("The root doesn't exist") %Εμφανιση μηνυματος οτι δεν βρεθηκε ριζα
end
disp("            n                 xn                    f(x)     ");
disp(a) %Εμφανιση του πινακα με τα αποτεσματα



x = -5; %Αρχικοποιηση του χ0
NMAX= 10; %Αρχικοποιηση των επαναληψεων
a=[1 NMAX]; %Δημιουργια πινακα για τον αποτελεσματων
for n = 1:NMAX 
  a(n,1) = n-1; %Το n που θα εμφανιζεται στον παραπανω πινακα
  a(n,2) = x; %Το χn που θα εμφανιζεται στον παραπανω πινακα
  a(n,3) = h(x); %Συναρτηση που θα εμφανιζεται παραπανω στον πινακα
  y = x - h(x)/hDer(x); %Υπολογισμος του x*
 if abs(y-x) <= TOL %Ελεγχος αν το x*  ειναι ριζα 
   disp("The root is: ")
   disp(y) %Εμφανιση ριζας
   break  %Τερματισμος σε περιπτωση που το προγραμμα βρει την ριζα πριν τελειωσουν οι NMAX επαναληψεις 
  end
  x=y;
  disp("")
end
  
if n == NMAX %Eλεγχος αν δεν βρεθηκε ριζα στις NMAX
  disp("Solution was not obtained in 10 iterations")
  disp("The root doesn't exist") %Εμφανιση μηνυματος οτι δεν βρεθηκε ριζα
end
disp("            n                 xn                    f(x)     ");
disp(a) %Εμφανιση του πινακα με τα αποτεσματα


x = -5; %Αρχικοποιηση του χ0
NMAX= 10; %Αρχικοποιηση των επαναληψεων
a=[1 NMAX]; %Δημιουργια πινακα για τον αποτελεσματων
for n = 1:NMAX 
  a(n,1) = n-1; %Το n που θα εμφανιζεται στον παραπανω πινακα
  a(n,2) = x; %Το χn που θα εμφανιζεται στον παραπανω πινακα
  a(n,3) = k(x); %Συναρτηση που θα εμφανιζεται παραπανω στον πινακα
  y = x - k(x)/kDer(x); %Υπολογισμος του x*
 if abs(y-x) <= TOL %Ελεγχος αν το x*  ειναι ριζα 
   disp("The root is: ")
   disp(y) %Εμφανιση ριζας
   break  %Τερματισμος σε περιπτωση που το προγραμμα βρει την ριζα πριν τελειωσουν οι NMAX επαναληψεις 
  end
  x=y;
  disp("")
end
  
if n == NMAX %Eλεγχος αν δεν βρεθηκε ριζα στις NMAX
  disp("Solution was not obtained in 10 iterations")
  disp("The root doesn't exist") %Εμφανιση μηνυματος οτι δεν βρεθηκε ριζα
end
disp("            n                 xn                    f(x)     ");
disp(a) %Εμφανιση του πινακα με τα αποτεσματα

